cf_billing/Documents/бестИзменитьПараметрыТочкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменитьПараметрыТочкиУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТочкиПоставкиТочекУчетаЮЛ</xr:Item>
				<xr:Item>InformationRegister.бестПотериТочекУчета</xr:Item>
				<xr:Item>InformationRegister.бестТехническаяВозможностьУстановкиПУ</xr:Item>
				<xr:Item>InformationRegister.бестСтруктураСетиТочекУчетаНП</xr:Item>
				<xr:Item>InformationRegister.бестЦеновыеКатегорииТочекУчета</xr:Item>
				<xr:Item>InformationRegister.бестТочкиПоставкиОбъектовРасчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегорияБыло</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетВозможностьУстановкиПУБыло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетВозможностьУстановкиПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставкиБыло</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСетиБыло</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Потери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПотерь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыПотерь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъемПотерьБыло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерьБыло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъемПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестТехническаяВозможностьУстановкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТехническаяВозможностьУстановкиПУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НетВозможностьУстановкиПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЦеновыеКатегорииТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЦеновыеКатегорииТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПотериТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПотериТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФиксированныйОбъемПотерь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПотерь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПотерь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыПотерь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтруктураСетиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтруктураСетиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТочкиПоставкиТочекУчетаЮЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТочкиПоставкиТочекУчетаЮЛ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТочкиПоставкиОбъектовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТочкиПоставкиОбъектовРасчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменитьПараметрыТочкиУчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Пакет = ПолучитьДанныеДляПроведения();
	
	ДанныеВозможностиУстановки		= Пакет[0];
	ДанныеЦеновыхКатегорий			= Пакет[1];
	ДанныеПотери					= Пакет[2];
	ДанныеСтруктурыСети				= Пакет[3];
	ДанныеТочкаПоставки				= Пакет[4];

	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВозможностиУстановки,		Движения.бестТехническаяВозможностьУстановкиПУ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЦеновыхКатегорий,			Движения.бестЦеновыеКатегорииТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПотери,					Движения.бестПотериТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСтруктурыСети,			Движения.бестСтруктураСетиТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочкаПоставки,			Движения.бестТочкиПоставкиТочекУчетаЮЛ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочкаПоставки,			Движения.бестТочкиПоставкиОбъектовРасчета);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	      		  |	&Период КАК Период
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУБыло <> бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУ
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегорияБыло <> бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегория
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ВидПотерь КАК ВидПотерь,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ТарифнаяЗона КАК ТарифнаяЗона,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ПроцентПотерь КАК ПроцентПотерь,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета.Потери КАК бестИзменитьПараметрыТочкиУчетаПотери
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |			ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |		ПО бестИзменитьПараметрыТочкиУчетаПотери.Ссылка = бестИзменитьПараметрыТочкиУчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.СтруктураСети КАК СтруктураСети
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.СтруктураСетиБыло <> бестИзменитьПараметрыТочкиУчета.СтруктураСети
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаПоставки КАК ТочкаПоставки
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.ТочкаПоставкиБыло <> бестИзменитьПараметрыТочкиУчета.ТочкаПоставки";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
